public class chapter_01 {
    //Оранжевый QA-учебник не про то, ЧТО нужно знать по тестированию
    //(про это написано и сказано достаточно).
    //Он про то, КАК правильно учиться и КАК быстрее получить первую QA-работу.

    //Первая часть, про правильное обучение тестированию


    //Нюансы поиска работы QA-новичками, про которые не говорят

    //Обычно вся информация по найму в сети базируется на двух источниках:
    //на делящихся личным опытом в статьях и видео QA-специалистах и на HR,
    //которые готовят карьерные треки курсов.
    //Возьмем на себя смелость утверждать, что оба этих источника знаний неидеальные. Почему?

    //…QA-лиды, которые не видят всю картину
    //Действующие QA-специалисты в основном делятся техническим опытом составления резюме и
    //прохождения собеседований. Это действительно очень ценная и полезная информация для новичка.
    //Ведь подготовка к техническому собеседованию — важнейшая часть поиска QA-работы.

    //Но техническое собеседование — лишь один из этапов найма,
    //и до него доходят меньше 1% изначально откликнувшихся на вакансию.
    //При этом в подавляющем числе случаев у собеседующего QA-лида есть элементы ошибки выжившего:
    //на собеседовании он видит только этот 1%.

    //Куда попали или действительно сильные кандидаты, или те, кто соврал в резюме,
    //либо сделал тестовое задание с ChatGPT и попал на собеседование, хотя не должен был на него попасть.
    //Может ли QA-лид дать валидные рекомендации середнячкам,
    //с учетом что большая их часть не доходит до него через HR-фильтр?


    //…HR-специалисты, которые заинтересованы в обратном
    //С карьерными треками QA-курсов, которые готовят HR-специалисты, тоже есть некоторые проблемы.
    //HR’ы в большинстве случаев грамотно расписывают нюансы и алгоритмы отклика на вакансии.

    //Не учитывая то, что обычные отклики на вакансии достаточно бесполезны для трудоустройства QA-джунов.
    //Когда конкуренция на одну позицию достигает нескольких тысяч кандидатов,
    //обычный отклик на вакансии перестает работать. И на российском рынке,
    //и тем более на западном для начинающего джуна-мануальщика отклики имеют достаточно низкую эффективность.


    //Правильный алгоритм для сообразительного новичка — двигаться в сторону сетевого поиска работы, нетворкинга.

    //Первая часть: как правильно учиться

    //Первая часть 📙 Оранжевого QA-учебника помогает найти ответы на следующие вопросы:
    //Как понять, надо ли именно тебе становиться тестировщиком?
    //Как стать конкурентноспособным QA, или Что такое "айсберг дефектов"?
    //Как учатся взрослые, или Почему опыт предыдущего образования будет тебе мешать?
    //Когда правильно учиться самостоятельно?
    //Чем отличаются разные подходы к QA-образованию, как не отдать деньги инфоцыганам
    //и как живет черный рынок отзывов?
    //Когда лучше учиться бесплатно?
    //Единственное, ради чего имеет смысл идти на платный курс (и на что обычно никто не обращает внимания)?
    //Почему хорошо, когда с курса отчисляют?
    //Как не стрессовать и не сойти с дистанции?
    //Чем отличаются практика, стажировка и интернатура?
    //Карьерные треки: больше вреда или пользы?

}
