public class chapter_14 {
    //Quality Assurance при обучении на QA

    //Что является самым главным для того, кто подумывает о профессии тестировщика?
    //Очевидно, найти такое обучение, которое приведет его к цели, — позволит получить QA-работу.

    //Спроси у преподавателя, наставника, куратора или ревьюера среднестатистического курса,
    //сколько из числа поступивших нашли работу тестировщиком в течение 6 месяцев с момента окончания обучения.
    //С высокой степенью вероятности ты ничего вразумительного в ответ не услышишь.

    //В основном курсы используют другие показатели оценки качества:
    //Complaints/Inquiries — количество жалоб и обращений студентов.
    //NPS (Net Promoter Score) — индекс лояльности студентов.
    //CSI (Customer Satisfaction Index) — индекс удовлетворённости студентов.
    //COR (Completion Rate) — процент успешно завершивших курс.

    //Последний показатель, COR, в общем-то неплохой. А вот с первыми тремя есть большая проблема.
    //Как мы говорили в одной из первых глав, "я получил то, что хотел и учеба мне очень понравилась"
    //почти никогда не совпадает с тем, "что на самом деле мне
    //было нужно и что хотел потенциальный работодатель".

    //Курс с замечательными, дружелюбными и мягкими преподавателями,
    //не напрягающими сложными заданиями,
    //может иметь положительную оценку от студентов в виде высоких NPS и CSI.
    //Но только по окончании курса большинство из них никуда не трудоустроится.
    //Так как созданные для них тепличные условия не позволили в необходимой степени прокачаться,
    //чтобы стать конкурентноспособными.

    //Поэтому (при всей необходимости NPS, CSI и COR) ключевым для курсов "обучения с нуля" следует
    //все-таки считать GER (Graduate Employment Rate) — процент трудоустройства выпускников.


    //Четыре этапа оценки качества обучения

    //Этап 1. Как студент реагирует на обучение
    //Получаем данные о том, как обучаемый реагирует на обучение.

    //Может существовать в виде опросной формы в LMS системе,
    //которую предлагается заполнить после очередного занятия или на каком-то определенном этапе.
    //Это не самый лучший вариант, так как опросный лист может не заполняться или заполняться формально.

    //Лучший вариант — индивидуальное глубинное интервью с каждым студентом несколько раз за курс.
    //В отличие от заполнения формы, к очному глубинному интервью студенту сложно подойти формально,
    //и даже не слишком общительных за 10–20 минут интервью "прорывает".
    //Число согласных на очное интервью обычно выше ожидаемого,
    //так как этот формат воспринимается студентами как более важный и на что-то влияющий, чем опросник.

    //Как часто используется на QA-курсах:
    //Опросные формы: 🟢 часто.
    //Индивидуальное глубинное интервью: 🔴 редко.

    //Этап 2. Что получено в результате обучения
    //Определяем, какие именно знания, навыки и умения студент получил за время обучения.

    //Как часто используется на QA-курсах: 🔴 редко.

    //Этап 3. Что из полученного применено на практике
    //Выясняем, какие именно полученные за время обучения знания,
    //навыки и умения студент применил на реальных задачах в ходе работы.

    //Это один из самых важных этапов определения качества обучения,
    //особенно при обучении начинающих QA-специалистов, которые пока достаточно смутно понимают
    //свои рабочие задачи и неспособны сформулировать объективные критерии.
    //Поэтому обратная связь этапа 3 ("Что мне на самом деле нужно было получить от обучения")
    //важнее обратной связи этапа 1 ("Что я хочу получить от обучения").

    //Как часто используется на QA-курсах: 🔴 крайне редко.

    //Этап 4. Каков бизнес-результат обучения
    //Спрашиваем, какую пользу принесли работодателю
    //полученные студентом за время обучения знания, навыки и умения.

    //Здесь в качестве интервьюируемого выступает уже не выпускник, а его непосредственный руководитель.
    //Кому, как не ему, определять, насколько подготовка данного специалиста выше или ниже "среднего по рынку",
    //насколько тот на самом деле эффективно решает стоящие перед бизнесом задачи.

    //Как часто используется на QA-курсах: 🔴 крайне редко.




}
