public class chapter_15 {
    //Карьерные треки: плюсы и минусы

    //Многим подготовленным выпускникам мешает синдром отличника.
    //Он проявляется не только в школе или институте, но и при обучении тестированию.
    //Зачастую первыми работу получают не те,
    //кто учился лучше всех, а середнячки, которые не демонстрировали выдающиеся успехи.

    //Отличники исправно заканчивают обучение, подготовив финальный проект и повторив изученный материал
    //перед выпускным экзаменом-собеседованием. Затем приступают к чтению материалов карьерного трека.
    //А в это же время кто-то из середнячков уже находится в конце
    //первого месяца испытательного срока на первой работе.

    //В первую очередь подобное можно объяснить тем, что происходит в голове многих отличников.
    //Особенно — когда учебная программа больше ориентирована на получение
    //теоретических знаний, нежели практических навыков.

    //Успешное выполнение каждой домашней работы и похвала от преподавателей при очном
    //обучении дают удовлетворенность, ощущение собственной значимости.
    //Начало работы со сложным заданием сперва вызывает стресс,
    //но потом, когда дело начинает идти, удовольствие от близости успеха и
    //одновременный рост дофамина в крови заставляют повторять и повторять этот опыт.
    //Хочется все новых и новых "ачивок".

    //Но поиск работы обычно представляет собой одну большую "ачивку".
    //Достиг результата — нашел работу. Не достиг результата — не нашел работу.
    //А на достижение результата могут уйти многие месяцы.
    //Причем, в отличие от учебы, в ходе этого длительного процесса уже никто не будет
    //ставить тебе промежуточные оценки. Поэтому многие отличники после окончания обучения,
    //приступив к поиску работы, перестают ощущать твердую опору под ногами.
    //Некоторые из них малодушничают, говорят себе: "Моих знаний пока недостаточно, нужно еще прокачаться".
    //И снова идут куда-то учиться, понемногу превращаясь в вечных студентов.
    //Хотя более правильная стратегия — начинать откликаться,
    //чтобы уже по обратной связи от рынка понимать, что нужно подтянуть.

    //Речь идет про то, что поиск первой работы значительно отличается от учебы.
    //Применять к процессу трудоустройства те же подходы, что и к обучению, означает совершать большую ошибку.

    //В некоторой степени эти сложности увеличивают и карьерные треки.
    //Потому что создатели курсов подходят к их созданию зачастую точно так же,
    //как и к разработке основного обучающего курса.

    //Плюсы карьерных треков

    //На большинстве курсов помощь в трудоустройстве в виде карьерного трека состоит
    //из полного или частичного набора следующих активностей.
    //Перечислим их в порядке возрастания полезности, от 1 (минимальная) до 9 (максимальная):

    //1 Подборки вакансий

    //2 Рассылка резюме в компании-партнеры

    //3 Учебные материалы по азам трудоустройства в виде вебинаров и предзаписанных видео

    //4 Ревью резюме и сопроводительных писем

    //5 Помощь в подготовке портфолио

    //6 Индивидуальные консультации по трудоустройству

    //7 Тестовые собеседования

    //8 Помощь выпускнику "оставаться на треке" в процессе поиска работы

    //9 Стажировка или интернатура в компаниях-партнерах

    //Начнем с самого малополезного: подборки вакансий и рассылка резюме в компании-партнеры.
    //Подборки вакансий выпускник может сделать самостоятельно — никакого
    //"секретного банка вакансий" не существует.

    //Рассылка резюме в компании-партнеры в большинстве случаев является формальным мероприятием.
    //У компаний нет никаких проблем с поиском резюме неопытных новичков.
    //Единственное полезное исключение — если между школой и компанией-партнером
    //есть договоренность отправлять лучших выпускников.
    //Но тогда, очевидно, это возможность далеко не для каждого.

    //Учебные материалы по азам трудоустройства в виде вебинаров и предзаписанных видео,
    //с одной стороны, могут быть весьма полезны.
    //Особенно для тех, кто еще молод и нигде толком не работал,
    //кто до этого работал в государственных структурах, или для тех, кто последние пять лет не менял работу.
    //Даже с такой базовой активностью, как составление качественного резюме,
    //90% выпускников курсов справляются крайне плохо и из-за этого потом не выдерживают конкуренции.
    //Все соискатели совершают одни и те же ошибки:
    //подробно расписывают все предыдущие, нерелевантные IT, места работы;
    //не указывают достигнутые достижения (пусть даже они и не коррелируют с IT).

    //Ревью резюме и сопроводительных писем уже более полезная активность,
    //так как и то и другое обретают более-менее нужный вид только после 5–10 этапов правки.
    //Чтобы это произошло, нужен опытный специалист,
    //который изучит резюме и сопроводительные письма и укажет на ошибки в них.

    //Подготовка портфолио для QA — неоднозначная вещь.
    //Если для дизайнера портфолио — это безусловный must have,
    //а для разработчика — быстрая возможность показать умение строить структуру проекта,
    //писать самодокументируемый, поддерживаемый и масштабируемый код,
    //то для тестировщика все несколько сложнее.
    //Отдельно выложенный набор тест-кейсов и баг-репортов позволят оценить умение их подготавливать,
    //что уже неплохо. Но трудно по этим отдельным артефактам определить навыки непосредственно
    //поиска дефектов, способностей делать общий анализ, в том числе технических требований,
    //составлять план тестирования и грамотно его реализовывать.
    //Поэтому хорошо, когда они есть, но их отсутствие нефатально.

    //Индивидуальные консультации по трудоустройству могут быть полезны при наличии предыдущего
    //опыта в актуальной для IT сфере и возможности бесшовного входа

    //Тестовые собеседования являются важной частью программы трудоустройства.
    //Они помогают:
    //освежить знания;
    //подготовиться к практическим вопросам;
    //научиться подавать себя;
    //меньше нервничать на реальном собеседовании.
    //Необходимо учитывать, что собеседование с HR-специалистом и
    //техническое собеседование — это два разных собеседования с разными задачами и подходами.

    //Помощь выпускнику "оставаться на треке" в процессе поиска работы является важной активностью,
    //потому что большинство подготовленных выпускников сходят с дистанции не из-за плохих знаний,
    //неумения составить резюме или подать себя на собеседовании. Это происходит из-за демотивации.
    //Ревью вакансий, контроль еженедельного объема активности по поиску работы и просто моральная
    //поддержка — все это может оказаться бесценным для достижения финального результата.

    //Стажировка и интернатура в компаниях-партнерах — самое ценное из того,
    //что может предложить карьерный трек.


    //Минусы карьерных треков

    //Карьерный трек — однозначно полезная для начинающего вещь. Во всяком случае, в теории.
    //На практике же реализация многих карьерных треков приводит к тому,
    //что они дают противоположный результат.

    //Почему те, кто вообще не участвовали во всех этих полезных активностях, находили работу быстрее?

    //#1. Непрофильная для многих курсов деятельность

    //#2. HR плохо знают IT

    //#3. Пренебрежительное отношение организаторов курсов к студентам, рынку и собственной репутации

    //#4. Те же рекомендации, что и везде

    //#5. После окончания курса слишком поздно искать работу


    //Воспринимай карьерный трек не как курс, который ты обязан пройти целиком,
    //а как источник полезной информации.
    //Ответственность за твое трудоустройство в конечном итоге лежит только на тебе самом.
}
