public class chapter_16 {
    //Итог 📙 Оранжевого QA-учебника

    //Как понять, что тестирование — это твое
    //0 Пойми, что мотивирует именно тебя в движении к тестированию.
    //Идеально, если это будет несколько истинных QA-мотиваторов без звездочки.
    //(глава "Нужно ли становиться QA?")

    //1 Определи финальный дедлайн.
    //(глава "Как эффективно учиться и понять что, тестирование — это твое")

    //2 Пройди бесплатный курс или почитай книги.


    //Как учиться самостоятельно (желательно использовать и при обучении на курсе)

    //3 Найди "собственного" ментора или на курсе.

    //4 Составь адекватный план. (с учетом "Как не стрессовать и не сойти с дистанции")

    //5 Начинай учебные спринты.

    //6 ... И одновременно с учебными спринтами начинай подготовку к трудоустройству.

    //7 После обучения должна начаться стажировка или интернатура (но не "Практика").

    //8 ... И активный поиск работы (крайне желательно начать его не позже старта стажировки/интернатуры).

    //9 Оффер.


    //Как выбрать качественный курс

    //1 Погуглить создателя курса. (глава "Хороший, плохой, злой подход к QA-образованию")

    //2 Запросить данные у представителя курса по чек-листу идеального курса.
    //(глава "Такие разные курсы")
    //Опциональное: если ты перфекционист, можешь спросить и про то, выставляются ли оценки в баллах,
    //есть ли автодедлайны, автопересдача и дневник.
    //(глава "Борьба с хаосом на курсе")

    //3У него же выяснить самое главное:
    //- кто проверяет ДЗ и дает обратную связь;
    //(глава "Самый главный параметр обучения")
    //- как выглядит получение практических навыков на курсе
    //(на лекциях и вебинарах их не получить, для этого нужны воркшопы, мастер-классы или практикумы);
    //(глава "Самый главный параметр обучения")
    //- будет ли именно стажировка/интернатура, а не "практика".
    // (сравнительная таблица в главе "Практика, стажировка или интернатура?")

    //Если ответы представителя не воодушевляют, нужно поменять выбор.
    //Если — положительные, то нужно убедиться у обучавшихся студентов,
    //что это действительно так (продажники могут приукрашивать).


    //4 Найти в LinkedIn пару выпускников с указанным QA-трудоустройством
    //(в компаниях не с одним человеком!). Не спрашивать, понравилось ли обучение,
    //а выяснить, легко ли нашел работу и что из изученного пригодилось, а чего не хватило.

    //5 Посмотреть пробные занятия:
    //1) Оценить, подходит ли тебе формат.
    //2) Снова обратить внимание, есть ли практические форматы (воркшопы) или только лекции-вебинары.


}
