public class chapter_07 {
    //Как эффективно учиться и понять, что тестирование — это твое

    //Многие из нас в 17–18 лет совершали ошибку, выбирая не тот путь, который на самом деле хотели.
    //Влияние родственников, друзей и обстоятельств приводило к определяющему
    //значительную часть жизни решению, которое на самом деле было ситуативным.

    //В силу странных особенностей мы аргументированно
    //воспринимаем только пропущенный лично через себя наработанный опыт.

    //Сейчас же у тебя есть возможность не совершить ошибку еще раз.
    //Твоим надежным партнером в этом станет осознанность.


    //"Что я хочу получить от обучения?"

    //В заголовок параграфа вынесен главный вопрос, который ты должен себе задать.

    //А ответом на него должен стать план.

    //Но как я могу составить план обучения тестированию, если я вообще ничего не знаю про тестирование?

    //...спросишь ты. С одной стороны, ты будешь в чем-то прав.
    //Но, с другой стороны, у тебя нет иного варианта: слепо доверять каким-то Youtube-советчикам,
    //составителям курсов или даже нам, авторам этого учебника, – не самый лучший вариант.
    //Так можно снова ошибиться.

    //Но с глобальным алгоритмом мы тебе поможем.
    //1 Финальный дедлайн
    //2 Бесплатный курс и книги
    //3 Ментор "собственный" или на курсе
    //4 Адекватный план
    //5 Спринты
    //6 Подготовка к трудоустройству
    //7 Стажировка/интернатура
    //8 Активный поиск работы
    //9 Оффер


    //Шаг 1. Финальный дедлайн
    //Так как мы любим начинать с конца, то имеет смысл сначала понять,
    //когда именно ты собираешься оказаться в финальной точке. Лучше, чем ты, тебя не знает никто.
    //Поэтому со сроком тебе придется определиться самостоятельно.

    //При самостоятельном обучении реалистичный срок — в районе 9 месяцев.
    //При учебе на курсе адекватный срок обучения при интенсивности
    //"теория и практика занимает 10–20 часов в неделю" находится в пределах 4–7 месяцев.
    //Меньше чем за 4 месяца адекватно прокачаться в профессии нереально.
    //При обучении более 7 месяцев начнет происходить перезаполнение мозга уже не самыми нужными знаниями,
    //и он начнет освобождаться от тех сведений, которые в него добавляли ранее.


    //Шаг 2. Бесплатный курс и книги
    //В сети есть множество хороших материалов по тестированию.
    //В зависимости от того, как ты привык потреблять информацию, ты можешь выбрать:

    //Бесплатный или почти бесплатный онлайн-курс по тестированию на Stepik
    //посмотреть онлайн-лекции QA-Youtube-блогеров Леши Маршала или Артема Русова;

    //Важная составляющая этого пункта: ты начнешь понимать, нравится тебе тестирование или нет.

    //Если по ходу изучения появится желание находить еще какую-то дополнительную информацию, то — это твое.

    //Если же в голове будет крутиться "какая скукота,
    //дальше-то хоть что-нибудь интересное будет?", то — увы.

    //Самое главное — это совершенно бесплатный с точки зрения денег и
    //относительно дешевый с точки зрения времени
    //(по сравнению с полноценным обучением) способ понять "мое это или не мое".


    //Шаг 3. Ментор "собственный" или на курсе



}
