public class chapter_03 {
    //Как стать конкурентоспособным QA

    //"Быть конкурентноспособным" может означать разное.

    //Можно быть конкурентноспособным как ценный специалист — в прямом смысле слова "ценный".
    //Твои компетенции актуальны, и ты умеешь решать разнообразные задачи бизнеса наиболее эффективным путем.
    //Это значит, что ты работаешь быстрее, совершаешь меньше ошибок, выполняешь операции наиболее оптимально.
    //Как результат, делаешь продукт качественнее и приносишь больше пользы потребителю.
    //А значит, твои услуги более ценны для работодателя.

    //Можно быть конкурентноспособным внутри своего проекта — когда твоему профессиональному
    //мнению не составить конкуренцию. Ты смотришь чуть глубже, чем остальные,
    //и поэтому предсказываешь проблемы несколько раньше, чем они возникают.
    //Менеджеры проектов и лиды конкурируют между собой, чтобы на следующий проект ты попал именно к ним.
    //К твоему мнению серьезно прислушиваются.

    //К определению "конкурентноспособного" можно отнести и то,
    //что ты явно не зря просиживаешь свое время в режиме "с 9 до 6".
    //Во всяком случае, ты точно не воспринимаешь это время, как прошедшее просто так.


    //Кто такой конкурентоспособный специалист

    //Очевидно, что это профессионал, который может выполнять свою работу лучше,
    //чем среднестатистический специалист.

    //Любого специалиста характеризуют три вещи: знания, навыки и умения.

    //Знания — это та теория, которой владеет специалист.

    //Навыки — это его практическая квалификация, нужная, чтобы выполнять необходимую работу.
    //Можно многое знать в теории, но ничего не уметь делать на практике.

    //Умения: специалист не просто что-то знает и может выполнить какую-то работу,
    //но способен найти оптимальный путь, предсказать ошибки и избежать их.
    //Чаще это называют словом "опыт".

    //Пять категорий специалистов

    //1. Неквалифицированный специалист
    //🔴 Знания: близкие к нулю.
    //🔴 Навыки: отсутствуют.
    //🔴 Умения (опыт): отсутствуют.

    //2. Низкоквалифицированный специалист (Trainee, трейни)
    //🟡 Знания: базовые.
    //🔴 Навыки: отсутствуют или совсем примитивные.
    //🔴 Умения (опыт): отсутствуют.

    //3. Начинающий специалист (Junior, джун)
    //🟡 Знания: базовые или средние.
    //🟡 Навыки: базовые.
    //🔴 Умения (опыт): отсутствуют.
    //Это специалист, который способен выполнять более или менее сложную работу,
    //состоящую из разных операций, но с контролем со стороны.

    //4. Опытный специалист (Middle, мидл)
    //🟢 Знания: продвинутые.
    //🟡 Навыки: средние.
    //🟡 Умения (опыт): средние.
    //Это специалист, который способен выполнять сложную работу без контроля со стороны.
    //При этом он, как правило, не способен в каждой конкретной ситуации находить
    //наиболее оптимальные решения и предсказывать проблемы.

    //5. Профессионал (Senior, сеньор)
    //🟢 Знания: продвинутые.
    //🟢 Навыки: продвинутые.
    //🟢 Умения (опыт): продвинутые.
    //Это специалист, который может справиться с любой сложной работой и сделать ее качественно и в срок.
    //Он способен находить наиболее оптимальные решения,
    //предлагать улучшения процессов и заблаговременно предсказывать проблемы, таким образом избегая их.

    //Становится кем-то ниже Джуна бессмысленно — ты не сможешь найти работу.
    //Но даже становится джуном — это не самая гарантированная тактика.
    //Требования работодателей постоянно растут.
    //Если раньше набирали только тех, кто что-то знает,
    //то теперь наниматели хотят видеть и того, кто что-то умеет.
    //То есть обладает необходимыми практическими навыками.

    //Поэтому, если цель твоего обучения — это действительно начать карьеру в IT,
    //то имеет смысл ориентироваться на уровень Junior+/Pre-Middle.
    //Это тот максимум, до которого реально допрыгнуть в обучении,
    //и тот минимум, при котором поиски работы не растянутся на полгода.

    //На собеседовании
    //Как оно будет проходить, о чем тебя будут спрашивать?
    //Главный, первый, хотя и далеко не единственный вопрос, который интересует работодателя,
    //— это, как мы уже выяснили, "Какими знаниями и навыками обладает этот соискатель?".

    //Знания: обманчивая профессия тестировщика или айсберг дефектов
    //Современные приложения сложные и состоят из множества частей.
    //Пользовательский интерфейс (UI), то что мы видим с тобой на экране, —
    //это единственная доступная обычному пользователю часть приложения.

    //Настоящие причины багов (они же ошибки, они же дефекты) могут находиться на
    //самых разных уровнях приложения. На пользовательском интерфейсе, в серверной части,
    //в базе данных или вообще в стороннем сервисе,
    //который поддерживает партнерская компания и информацию из которого мы используем.
    //И только небольшая часть ошибок находятся непосредственно в коде пользовательского интерфейса.
    //Остальные прячутся от нас в других частях приложения.

    //Если пользователь не видит ошибку — значит, это не ошибка.

    //Но возникает ряд встречных вопросов:

    //Как ты выявишь ошибку, которая проявляется только тогда, когда в Акапулько полдень?
    //Современные приложения очень сложные, и конкретная ошибка может возникать при сочетании
    //нескольких условий. Добиться их совпадения с пользовательского интерфейса не всегда можно
    //с первого раза. В вышеуказанном примере придется оставаться на работе на ночь.
    //А вот проверить каждое условие в отдельности вполне возможно.
    //Правда, ради этого придется погрузиться несколько глубже интерфейса.

    //Что ты будешь делать, если у приложения нет пользовательского интерфейса?

    //Хорошо, ты действительно нашел ошибку.
    //Какой именно программист из нескольких десятков должен ее исправлять?

    //Почему ты вообще решил, что проблема на стороне программистов?

   //Какие можно сделать выводы:
    // 1. Если тестировать разные части приложения, а не только UI, то вероятность найти дефект намного выше.
    // 2. Чем раньше найден дефект, тем меньше специалистов потребуется для его исправления и тем он дешевле.


    //Навыки: надо не просто знать, надо что-то уметь
    //знать (иметь знания) и уметь (иметь навыки) — это "две большие разницы".

    //Частая проблема с практическими навыками

    //Работодатели не готовы платить за знания. В случае тестирования:
    //Знания не позволят сделать качественное статическое тестирование.
    //Знания не позволят грамотно покрыть функциональность тест-кейсами.
    //Знания не поднимут качество продукта.

    //Единственное, что может помочь работодателю — это практические навыки.
    //В идеале — умения (опыт).

    //Здесь многие свежеиспеченные QA-джуны сталкиваются с серьезной проблемой.
    //Сложно себе представить начинающего программиста, который не написал ни одной программы.
    //Но начинающий тестировщик, который не протестировал целиком ни одного приложения — обычное явление.

    //Из-за особенностей специальности тестировщика практические навыки получить непросто.
    //Про это мы говорим дальше.

    //Пока же нужно запомнить, что фраза говорящих
    //"я прекрасно выучил тестирование, но уже давно не могу найти работу,
    //потому что слишком большая конкуренция среди начинающих тестировщиков"
    //содержит истинную причину проблемы с трудоустройством.

    //Поэтому главное, о чем нужно задумываться при обучении тестированию, —
    //это не только получение знаний, но получение практических навыков.

    //У навыков есть и еще одно важное качество: Не подкрепленные навыками знания забываются.

    //Навыки: сложность получения для QA

    //Чем профессия тестировщика однозначно сложнее профессии разработчика — это сложностью получения навыков.

    //Если разработчик освоил язык программирования, то все, что ему нужно,
    //чтобы создать что-то для своего портфолио или пет-проекта(opens in a new tab) (pet project),
    //— открыть среду разработки и написать первую сотню строчек кода.

    //В случае тестировщика, сложно открыть первое попавшееся приложение и "найти в нем багу".
    //Нет, самые простейшие дефекты на UI он найдет, но что дальше?
    //Это странное поведение системы — это ожидаемая функциональность или все-таки дефект?
    //Посмотреть бы в требования, но кто их просто так покажет?
    //Посмотреть бы что там в API, но данных по нему тоже нет.


    //Как стать конкурентоспособным QA?

    //Запланируй знания
    //Если мы говорим про осознанное обучение, — а это единственный шанс получить качественный результат,
    //— то необходимо определиться с необходимым перечнем знаний,
    //которыми ты будешь обладать по окончании обучения.

    //Вне зависимости от того, учишься ли ты самостоятельно или на каком-либо курсе, сделай следующее:
    //1 Проанализируй вакансии.
    //Если ты готовишься быть конкурентным специалистом, то вакансии содержат перечень того,
    //что ты должен знать и уметь.
    //2 Проанализируй программы разных курсов.
    //Есть плохие курсы и есть хорошие. Но они отличаются в основном не тем, чему учат, а тем, как учат.
    //То есть обучающие программы у них зачастую будут отличаться не очень сильно.

    //Запланируй навыки
    //Заранее продумай, где и как ты будешь их получать.
    //Если ты учишься самостоятельно,
    //то с получением первичных навыков тебе может помочь платный или бесплатный ментор.
    //Если ты учишься на курсе, то первичные навыки тебе обязаны преподать на нем.

    //Закрепление и развитие навыков, вне зависимости от того,
    //учишься ты самостоятельно или в каком-нибудь образовательном учреждении,
    //нужно получать уже в реальном окружении.
    //Подробнее про практику, стажировки и интернатуры мы поговорим позднее.


    //Как достичь результата

    //Раз ты учишься сам, у тебя есть отличная возможность разработать программу обучения
    //"под себя" — нужной глубины и сложности.
    //В сети предостаточно материалов, вопрос лишь в том,
    //чтобы сделать не слишком простую и не слишком сложную программу.
    //До начала обучения обязательно определись, где, как и когда будешь получать практику!
    //Иначе в какой-то момент ты зайдешь в тупик.
    //Про организацию самостоятельного обучения мы еще поговорим.




}
