public class chapter_08 {
    //Учиться самостоятельно или на курсе?

    //Вопрос, учиться самостоятельно или на курсе, на самом деле не имеет особого значения.
    //IT — это, так или иначе, про самостоятельное обучение.
    //Поэтому, независимо от выбора, тебе все равно придется плотно поработать.

    //Объем знаний любой IT-профессии велик, и тем более такой разнообразной профессии тестировщика.
    //Он слишком большой, чтобы его можно было осмысленно уместить в какой-либо учебной программе.
    //Но даже если бы такой курс появился, то в нем не было бы особого смысла,
    //так как без преобразования знаний в навыки на практике эти самые знания быстро исчезнут.

    //Как бы ты ни учился профессии на старте,
    //тебе все равно придется потом непрерывно продолжать учиться и в основном самостоятельно.


    //Плюсы и минусы самостоятельного обучения
    //Кому однозначно показана такая замечательная вещь, как самостоятельное обучение?

    //Имеющим околоайтишный опыт — включая (но не ограничиваясь) техподдержку, системное администрирование.

    //Имеющим инженерное образование и инженерный опыт хотя бы в пару лет.

    //Дисциплинированным с выраженной мотивацией (когда в разделе "Нужно ли становиться QA?"
    //выбраны в основном QA-мотивации или мотивации со звездочкой).

    //Тем, у кого рядом или в сети есть тот, кто готов еженедельно хотя бы пару часов помогать с практикой.

    //Про 8 шагов обучения, в том числе при самостоятельном обучении,
    //мы подробно поговорили в предыдущей главе. Указанный алгоритм позволит самообразовываться
    //качественно и в разумный срок, без слишком большого закапывания.


    //Самое главное — помни, что по каждому изученному тобой элементу теории необходимо
    //стараться сразу же получить некоторый практический опыт.
    //И это должен быть не какой-то тест, а как минимум действительно сложное домашнее задание.
    //Которое в идеале похоже на реальные стоящие перед тестировщиком задачи.


    //Плюсы и минусы обучения на курсе

    //Основная сложность, возникающая при самостоятельном обучении, не связана с недостатком информации.
    //Ее как раз много и даже слишком много.

    //Главная проблема заключается в том, что обучаться практической специальности
    //без получения практических навыков достаточно сложно.
    //Обладающие инженерным складом ума, околоайтишным опытом и, тем более, при наличии рядом того,
    //кто готов выступить ментором, эту проблему могут обойти или нивелировать.
    //При отсутствии же такого бэкграунда обучиться с нуля и стать пусть начинающим,
    //но ценным кадром для работодателя может быть сложно.

    //Обучение на курсе имеет смысл только по одной главной причине — это получение практики.


    //Обучение на курсе IT-компании "для себя"

    //Это самый замечательный вариант курсового обучения, какой только можно представить:
    //IT-компания самостоятельно проводит обучение новичков для последующей работы внутри компании.

    //Во-первых, компания берет не всех, а проводит отбор.
    //И те, у кого нет способностей к тестированию, не будут тратить время впустую.
    //В отличие от коммерческих курсов, где готовы брать любого с деньгами.

    //Во-вторых, тут обучение заведомо качественное
    //(зачем компании тратить время на обучение плохих сотрудников?),
    //а программа обучения целиком и полностью соответствует тому,
    //что действительно пригодится на работе в данной конкретной компании.

    //В-третьих, и что немаловажно, такое обучение зачастую бесплатное.


    //Обучение на коммерческом курсе

    //К минусам данного варианта можно отнести то, что он:
    //а) платный; б) качественное образование найти сложно, несмотря на огромный выбор предложений на рынке.



}
