public class chapter_13 {
    //Профессиональное QA-обучение vs коммерческое

    //Обсуждение видов обучения будет неполным без разговора про профессиональное QA-обучение,
    //апологетами которого являются менторы, создавшие этот учебник.

    //Целесообразно поговорить сначала о том, в чем состоит его идея, а затем про то,
    //как эта идея воплощается на практике и что дает студентам.

    //Идея.
    //Идея профессионального QA-обучения противопоставляет себя идее коммерческого обучения.

    //Коммерческий подход к QA-обучению
    //•мотивация менторов: самореализация и $;
    //•коммерческие интересы школы стоят выше интересов студента;
    //•зачисление на курс после успешной оплаты;
    //•KPI школы: число студентов, ROI.

    //Первичная идея коммерческого образования — предоставить актуальный образовательный продукт,
    //который дает студентам необходимые знания и навыки.

    //Основной показатель успеха коммерческой школы — количество обученных студентов и прибыльность.


    //Профессиональный подход к QA-обучению
    //Противопоставление профессионального подхода коммерческому иногда может приводить к мысли,
    //что оно бесплатное, раз некоммерческое.
    //Это не так и даже, скорее, наоборот: профессиональное обучение обычно стоит дороже коммерческого.
    //Но оно развивает ту идею, что ряд компромиссов коммерческого образования мешают рынку
    //получать качественных профессионалов.

    //Как профессиональное QA-обучение это исправляет:
    //•мотивация менторов: улучшение качества IT-специалистов на рынке;
    //•интересы студента стоят выше коммерческих интересов школы;
    //•зачисление на курс — только после полноценной профориентации и скрининга;
    //•KPI школы: число успешных карьер выпускников.

    //Первичная идея профессионального QA-обучения — без каких-либо компромиссов сделать всё,
    // чтобы IT-рынок гарантированно получил качественных профессионалов.

    //Основной показатель успеха профессиональной школы — число начавших IT-карьеру среди выпускников курса.


    //Реализация

    //Профессиональное QA-обучение на практике реализуется таким образом,
    //чтобы избежать наиболее типичных проблем, которые возникают у начинающих
    //карьеру в тестировании при помощи коммерческого образования.

    //Факт №1: 70% обучающихся не становятся тестировщиками

    //Факт №2: прослушивание лекций не поможет получить работу тестировщиком

    //Факт №3: для получения работы тестировщика уже должен быть QA-опыт
    //Чтобы разорвать замкнутый круг, используется двухмесячная интернатура на реальном бизнес-проекте.

    //Важные условия
    //Есть два важных условия, без выполнения которых профессиональное QA-обучение не будет работать:
    //Занятия в группах из максимум 15 студентов
    //Менторы с опытом более 10 лет


    //Важное следствие (и снова Кривая Эббингауза)

    //Напомним, эта кривая свидетельствует, что если мы хотим запомнить определенную информацию надолго,
    //то должны повторить ее не один раз.
    //Трехуровневая модель хорошо работает с точки зрения запоминания через повторение.
    //Каждая очередная тема изучается поэтапно:

    //Учебник
    //Из главы учебника получены необходимые знания по теме.

    //Тест в конце главы учебника
    //Интерактивным тестом проверено усвоение и запоминание знаний.

    //Воркшоп
    //Через работу в группе под руководством опытного ментора знания "утрясаются",
    //и формируются первые практические навыки.

    //Домашнее задание
    //Не проверяет наличие знаний, а помогает выработать практические навыки.

    //Правильно реализованное, отвечающее вышеуказанным требованиям,
    //профессиональное QA-обучение дает результаты, недостижимые при коммерческом подходе:
    //80–90% поступивших успешно завершают обучение и 80–90% из них успешно трудоустраиваются.
    //Для коммерческого обучения аналогичные показатели обычно в 3–4 раза ниже.


}

