public class chapter_06 {
    //Как взрослые учатся

    //Плохая новость состоит в том, что для обучения в зрелом возрасте приходится
    //не только прикладывать ожидаемые усилия по получению знаний и навыков,
    //но и активно избавляться от тех установок, которым нас учили ранее.
    //Ведь в подавляющем большинстве случаев всех нас учили в школе по старым канонам.
    //Которые для современной жизни уже не очень актуальны.

    //Отличия школьного и взрослого образования
    //Сравним разницу "школьных" подходов и того,
    //что необходимо сегодня для обучения квалифицированного специалиста:

    //Как учатся в школе:
    //•Установленная цель: получить аттестат о получении среднего образования с высокими оценками.

    //•Задачи учителя: передать знания.

    //•Роль учителя: просветитель.

    //•Осознанность в обучении: минимальная —
    //"потому что так надо", "позже, после окончания вуза, тебе это обязательно пригодится"
    //(причем данный срок сравним с текущим возрастом ученика).

    //•Мотивация: в большинстве случаев внешняя — получить хорошую оценку от учителей,
    //быть лучшим в классе, порадовать родителей,
    //сделать домашнее задание и потом заняться более интересными вещами или "чтобы отвязались".

    //•Предыдущий жизненный опыт: в обучении не используется по причине отсутствия.

    //•Самостоятельность: как правило, не приветствуется.

    //•Применение полученных знаний на практике: в средних и старших классах — минимальное.

    //•Обратная связь от учащегося к учителю: только на уровне полученных оценок
    //(если большинство учебной группы не справляется, значит,
    //что-то в образовательном процессе пошло не так).

    //•Обратная связь о карьерных успехах обучавшихся: не собирается и не анализируется.


    //Как учатся взрослые

    //•Установленная цель: достичь конкретных личных целей:
    //получить новую профессию, более интересную работу, повысить доход.

    //•Задачи учителя: сформировать навыки и умения.

    //•Роль учителя: мастер ("делай как я"),  ментор ("подумай и попробуй")
    //или фасилитатор ("обсудите и попробуйте").

    //•Осознанность в обучении: максимальная — "хочу изучать только то, что мне понадобится".

    //•Мотивация: в большинстве случаев — внутренняя: повысить качество своей жизни,
    //удовлетворить потребность в уважении, познании, самоактуализации.

    //•Предыдущий жизненный опыт: активно используется в качестве фундамента
    //для новых знаний и навыков (при качественном обучении), также вспомни про "бесшовный вход".

    //•Самостоятельность: поощряется.

    //•Применение полученных знаний на практике: максимальное, "здесь и сейчас".

    //•Обратная связь от учащегося к учителю: активно собирается и анализируется (при качественном обучении).

    //•Обратная связь о карьерных успехах обучавшихся:
    //активно собирается и анализируется (при качественном обучении).


    //Как можно легко заметить, ни один из пунктов в случае школьного обучения
    //и взрослого обучения не совпадает.


    //Почему так происходит?
    //Причины этого очевидны:
    //Задача школьного (и классического высшего образования) — задать уровень некого среднего специалиста,
    //универсального и полезного на любой работе.
    //Задача образования взрослых — найти каждому именно его место.
    //У взрослого нет времени ни на 5 лет университетского, ни на 10-12 лет школьного обучения.
    //Изменения в обществе, социуме и профессиях происходят всё активнее,
    //новые знания появляются все быстрее, и учить то,
    //что возможно потом понадобится — непозволительная роскошь.
    //Взрослый, в отличие от подростка, обладает жизненным опытом.
    //Он лучше знает свои цели, понимает себя, свои сильные и слабые стороны.
    //Он хочет более индивидуального обучения.


    //Что помогает и мешает при образовании взрослых

    //Обучение и любознательность встроены в нас от рождения. Это хорошая новость.
    //Плохая состоит в том, что предыдущий опыт обучения может нам мешать.

    //Что мешает
    //При обучении используются вышеуказанные "школьные" установки.
    //В случае и так непростого IT-обучения это усугубляется тем,
    //что многие учебные программы разрабатываются универсальными специалистами,
    //которых учили одновременно и педагогике (обучению детей) и андрагогике (обучению взрослых).
    //А как мы увидели выше, у них нет ничего общего.
    //Предыдущий негативный школьный или вузовский опыт обучения.
    //Нехватка времени из-за наличия профессиональных и личных обязательств.

    //Что помогает

    //Хорошая новость — человек от природы не только любознателен, но и упрям.
    //Поэтому далеко не любому педагогу удается "исправить" каждого школьника до конца.

    //Что сильно может помочь тебе, взрослому человеку, повысить эффективность своего обучения:

    //Изначально — четкое понимание своей мотивации.

    //Осознанное определение целей своего обучения. Для чего, как, в какие сроки.
    //Ранее мы разобрали это в главе "Как стать конкурентоспособным QA" и поговорим позже
    //в главе "Как эффективно учиться и понять, что тестирование это твое".

    //Ясное понимание своих особенностей, уникальности своего опыта, сильных и слабых сторон
    //и на их основе формирование портрета безстрессового, позволяющего избежать проблем, обучения.

    //На основе вышеуказанного анализа — выбор наиболее подходящего именно для тебя формата обучения


    //Как достичь результата

    //Задавай цели для своего обучения сам.
    //Не ориентируйся на советы знакомых, экспертов или организаторов курса.

    //Далее, вне зависимости от того, учишься ты самостоятельно или на курсе,
    //при изучении каждой темы задавай себе вопрос: "Как это приблизит меня к цели моего обучения?"

    //Если ответ "Не знаю", то возможны два варианта.
    //Первый вариант — эта тема действительно нужна, но ты об этом почему-то не узнал.
    //Тогда сделай работу надо ошибками.
    //Второй вариант — обучение некачественное или нерелевантное твоей цели.
    //В этом случае необходимо пересмотреть план обучения или подход к нему.

    //
}
