public class chapter_05 {
    //Какие бывают компании и когда возможен бесшовный вход

    //Параметры компаний
    //•IT — это основной бизнес или нет?
    //•Продукт-сервис или аутсорс?
    //•Сфера деятельности
    //•Форма собственности
    //•География разработки и бизнеса
    //•Размеры компании и IT-отдела
    //•Уровень риска (и драйва) в стартапах
    //•Близость к "железу"
    //•Дружелюбность для старта карьеры
    //•Бонус: Коэффициент фрилансера


    //IT — это основной бизнес или нет?

    //IT может быть основным IT-бизнесом компании,
    //а может быть одним из его подразделений, обслуживающих задачи основного бизнеса.

    //В чем отличия для тестировщика?
    //Лет двадцать назад отличия были существенными,
    //и IT-подразделение компании было действительно просто одним из множества подразделений,
    //с соответствующими ограничениями по бюджетам и возможностями развития.
    //Теперь же IT — это одно из важнейших направлений не только для IT-компаний.
    //Поэтому в IT-подразделении даже неайтишной компании можно успешно развиваться и хорошо зарабатывать.


    //Продукт-сервис или аутсорс?

    //Если мы говорим не про IT-подразделения компаний, а про компании,
    //у которых IT — это основной бизнес, то здесь есть два больших подвида:
    //компании, которые производят продукты-сервисы,
    //и компании, которые оказывают аутсорс-услуги.
    //Грань между ними может быть достаточно тонкой.

    //Продуктовая компания специализируется на производстве программ для компьютеров или телефонов
    //(коробочного продукта) или же производит какой-то облачный сервис.

    //Аутсорсная компания работает "по заказам", помогает другим компаниям производить программы или сервисы.

    //В чем отличия для тестировщика?

    //Если хочется несколько лет подряд работать с каким-то одним продуктом,
    //то лучше идти в продуктовую компанию.

    //Если же мысль о тестировании одного и того же функционала на протяжении многих месяцев пугает,
    //то для тебя — разнообразие работы в сервисной компании.
    //Там можно за полтора года поработать на нескольких проектах для разных заказчиков
    //из самых разных областей.


    //Сфера деятельности

    //Перечислим наиболее популярные сферы:
    //1 - Финтех — все, что касается банков и финансов (Сбер, Тинькофф)
    //2 - Телеком — создание инфраструктуры для работы самого IT (TimeWeb, Мегафон, Дом.ру)
    //3 - Продукты и сервисы B2c — причинение пользы конкретным индивидуальным пользователям:
    //от поисковых систем до стриминговых сервисов (Яндекс, Кинопоиск, Ivi, Okko, Avito)
    //4 - Продукты и сервисы B2B — все, что касается помощи компаниям и обществу в целом
    //(Телфин, Zorra, ИнфоТеКС, Directum, Контур)
    //5 - И все остальное, что входит в сектор услуг — торговля оффлайн и онлайн (e-commerce),
    //образование, здравоохранение, транспорт, туризм, строительство
    //6 - Реальный сектор экономики — решения для предприятий легкой, тяжелой,
    //пищевой промышленности (Сигма, НТЦ ЕЭС, Siemens)
    //7 - Производители электромобилей и автопилотов (Атом, Tesla, Waymo).
    //8 - Искусственный интеллект и все, что с ним связано (NtechLab, OpenAI, DeepMind).
    //9 - Компании наукоемкой и космической промышленности (TSMC, Qualcomm, SpaceX).

    //Стоит отметить, что во всех перечисленных сферах деятельности могут быть как продуктовые компании,
    //так и аутсорсинговые.

    //Отдельно стоит геймдев. Это большой рынок, но с точки зрения QA он предполагает другие подходы
    //к тестированию и обучаться именно тестированию игр необходимо отдельно.


    //Не все задумываются над тем, что переходить в тестирование, —
    //это необязательно перечеркивать весь свой предыдущий многолетний опыт работы.
    //Предыдущий опыт может серьезно упростить поиск первой работы,
    //так как профильный, уже знающий сферу работы кандидат, в свою очередь,
    //сильно упрощает жизнь работодателю.


    //Форма собственности

    //Основных разделений три.
    //Если пренебречь нюансами, то компания может быть
    //частной (контролируется несколькими частными или юридическими лицами),
    //публичной (акции может купить любой желающий) или
    //государственной (государство контролирует больше 50% компании напрямую или опосредованно).

    //Пример для РФ:
    //крупная хостинговая компания Мастерхост — частная,
    //Ozon — публичная,
    //Ростелеком — государственная.

    //В чем отличия для тестировщика?

    //У публичных компаний обычно все хорошо с деньгами,
    //но зачастую плохо с долгосрочным планированием и качеством работы.
    //По той причине, что публичным компаниям часто приходится ориентироваться на мнение рынка
    //и держателей акций, а у тех настроение меняется очень часто.

    //Работа в частной компании существенно зависит от личности основателя и/или генерального директора.
    //Здесь могут быть как самые худшие, так и самые лучшие компании.
    //Ведь основатель (или несколько основателей компании) не обязаны ориентироваться на чье-либо мнение.

    //Государственные компании или компании с государственным участием обычно наименее динамичные,
    //но там есть "социальная защищенность и стабильность", что бы под этим не подразумевалось.


    //География разработки и бизнеса

    //Компания может работать на локальном рынке, там где она и производит софт.
    //Может производить софт локально,
    //но при этом обслуживать клиентов в другой стране или вообще по всему миру.

    //В чем отличия для тестировщика?

    //Отличия очевидны: в компаниях, работающих более чем на одном рынке,
    //выше требования, но и больше возможностей в получении опыта работы в транснациональных командах и,
    //при необходимости, релокации.
    //В таких компаниях зачастую можно перемещаться между проектами и странами,
    //оставаясь при этом в одной и той же компании.


    //Размеры компании и IT-отдела

    //Компания может быть очень большой, с тысячами сотрудников, но при этом не относиться к IT.
    //И тогда в ее IT-департаменте может работать меньше ста IT-специалистов.

    //Даже в IT-компании больше половины сотрудников могут представлять
    //менеджмент, экономистов, маркетологов и продажников.

    //Поэтому размеры компании имеет смысл считать не по общему числу сотрудников,
    //а именно по числу IT-специалистов в компании:
    //микро: меньше 10 IT-сотрудников в компании
    //(любой стартап на первичной стадии, IT-отдел небольшой компании)

    //малая: от 10 до 50

    //средняя: от 50 до 200 (в Ivi работает ~150 IT-специалистов)

    //большая: от 200 до 1000 (в Lamoda работает ~800 IT-специалистов)

    //крупная: от 1000 до 5000
    //(в Тензоре работает ~2'000; в Касперском, в Тинькофф работает ~1500 IT-специалистов)

    //конгломерат: от 10'000 (в Google, Microsoft ~30'000–50'000 IT-специалистов)

    //В чем отличия для тестировщика?

    //Начинающему тестировщику имеет смысл работать в микро-компании или микро-департаменте,
    //только если он очень амбициозен и компания собирается активно расти
    //(хотя сложно найти небольшую компанию, которая бы не планировала это делать).

    //Минусы микро-компании:
    //ресурсов всегда не хватает, приходится выполнять работу за нескольких
    //человек и при этом никто толком не может объяснить, как это всё должно работать.
    //Потому что на проекте банально может не быть QA с опытом сеньора.

    //Плюсы вырастают из минусов:
    //отсутствие ресурсов и знаний заставляет заниматься серьезной прокачкой собственных
    //навыков и становиться ценным на рынке специалистом.

    //Крупные компании и конгломераты, исходя из этого, имеют очевидный минус:
    //сложно будет получить богатый опыт.
    //Хотя если между подразделениями достаточно легкий переход, то этот минус незначим.


    //Уровень риска (и драйва) в стартапах
    //Малые IT-компании (10–50 IT-сотрудников) часто являются стартапами.
    //А микро-компании (менее 10 IT-сотрудников) — почти всегда.


    //Близость к "железу"

    //Часть компаний работают чисто с программными решениями.
    //Часть компаний — с программно-аппаратными решениями.

    //Для написания финансового сервиса, сервиса доставки или картографического приложения
    //никакого оборудования не надо.

    //Протестировать же мобильное приложение или софт к медицинскому оборудованию
    //без наличия "фермы" из десятка разных телефонов разных производителей
    //или этого самого медицинского оборудования достаточно сложно.
    //Существуют программные эмуляторы оборудования, но они не позволяют выполнить все виды тестирования.

    //В чем отличия для тестировщика?

    //Если ты мечтаешь об удаленной работе,
    //то при необходимости тестировать на проекте "железо" шансы на удаленку резко снижаются.


    //Дружелюбность для старта карьеры

    //Дружелюбная для старта карьеры новичка компания выглядит так:
    //В компании изначально небольшая текучка.

    //Есть наставник-ментор на первые месяцы работы (это самое важное!).

    //На проекте есть как минимум один тестировщик уровня Senior.

    //В компании есть Agile, а не что-то похожее на него
    //(изначально выучившись работать неправильно, потом переучиться очень сложно) и точно не Waterfall.

    //В компании уже есть программа обучения сотрудников, а не "только планируется".

    //В чем отличия для тестировщика?

    //Самое главное для QA-новичка — это быстрый и качественный старт карьеры.
    //Попав не в ту компанию, можно потерять полгода-год жизни, опыта и задела на рост зарплаты.


    //Как достичь результата
    //Важно помнить, что для IT-компаний кандидаты с профильным опытом
    //в конкретной предметной области представляют особый интерес.
}
