public class chapter_07 {
    //Как эффективно учиться и понять, что тестирование — это твое

    //Многие из нас в 17–18 лет совершали ошибку, выбирая не тот путь, который на самом деле хотели.
    //Влияние родственников, друзей и обстоятельств приводило к определяющему
    //значительную часть жизни решению, которое на самом деле было ситуативным.

    //В силу странных особенностей мы аргументированно
    //воспринимаем только пропущенный лично через себя наработанный опыт.

    //Сейчас же у тебя есть возможность не совершить ошибку еще раз.
    //Твоим надежным партнером в этом станет осознанность.


    //"Что я хочу получить от обучения?"

    //В заголовок параграфа вынесен главный вопрос, который ты должен себе задать.

    //А ответом на него должен стать план.

    //Но как я могу составить план обучения тестированию, если я вообще ничего не знаю про тестирование?

    //...спросишь ты. С одной стороны, ты будешь в чем-то прав.
    //Но, с другой стороны, у тебя нет иного варианта: слепо доверять каким-то Youtube-советчикам,
    //составителям курсов или даже нам, авторам этого учебника, – не самый лучший вариант.
    //Так можно снова ошибиться.

    //Но с глобальным алгоритмом мы тебе поможем.
    //1 Финальный дедлайн
    //2 Бесплатный курс и книги
    //3 Ментор "собственный" или на курсе
    //4 Адекватный план
    //5 Спринты
    //6 Подготовка к трудоустройству
    //7 Стажировка/интернатура
    //8 Активный поиск работы
    //9 Оффер


    //Шаг 1. Финальный дедлайн
    //Так как мы любим начинать с конца, то имеет смысл сначала понять,
    //когда именно ты собираешься оказаться в финальной точке. Лучше, чем ты, тебя не знает никто.
    //Поэтому со сроком тебе придется определиться самостоятельно.

    //При самостоятельном обучении реалистичный срок — в районе 9 месяцев.
    //При учебе на курсе адекватный срок обучения при интенсивности
    //"теория и практика занимает 10–20 часов в неделю" находится в пределах 4–7 месяцев.
    //Меньше чем за 4 месяца адекватно прокачаться в профессии нереально.
    //При обучении более 7 месяцев начнет происходить перезаполнение мозга уже не самыми нужными знаниями,
    //и он начнет освобождаться от тех сведений, которые в него добавляли ранее.


    //Шаг 2. Бесплатный курс и книги
    //В сети есть множество хороших материалов по тестированию.
    //В зависимости от того, как ты привык потреблять информацию, ты можешь выбрать:

    //Бесплатный или почти бесплатный онлайн-курс по тестированию на Stepik
    //посмотреть онлайн-лекции QA-Youtube-блогеров Леши Маршала или Артема Русова;

    //Важная составляющая этого пункта: ты начнешь понимать, нравится тебе тестирование или нет.

    //Если по ходу изучения появится желание находить еще какую-то дополнительную информацию, то — это твое.

    //Если же в голове будет крутиться "какая скукота,
    //дальше-то хоть что-нибудь интересное будет?", то — увы.

    //Самое главное — это совершенно бесплатный с точки зрения денег и
    //относительно дешевый с точки зрения времени
    //(по сравнению с полноценным обучением) способ понять "мое это или не мое".


    //Шаг 3. Ментор "собственный" или на курсе

    //При самостоятельном обучении тебе пора озаботиться помощью того,
    //кто будет проверять твои домашние задания.
    //Искать того, кто будет с тобой заниматься "под ключ" – давать и теорию,
    //и проверять домашние задания – особого смысла не имеет.
    //Низкокачественный специалист тебе не поможет,
    //а даже свободное время более или менее опытного тестировщика стоит столько,
    //сколько ты вряд ли захочешь платить.


    //Шаг 4. Адекватный план

    //Теперь ты знаешь, к какому сроку и что именно ты хочешь выучить.
    //Пора заниматься планом.

    //Если ты учишься самостоятельно,
    //то за основу берешь план какого-либо курса и сверяешься с тем,
    //что ты выяснил ранее из планов других курсов и вакансий.
    //Его нужно показать найденному тобой ментору.
    //Так как у тебя уже есть кое-какие первичные знания,
    //то по его комментариям ты заодно сможешь оценить и адекватность самого ментора.

    //Если ты собираешься обучаться на курсе, внимательно изучи программу курса и убедись,
    //что она соответствует твоим ожиданиям.


    //Что такое адекватная учебная программа курса?

    //Это, как правило, pdf-файл (на лендинге подробную детализацию обычно не делают).
    //Есть детализация не просто до названий конкретных занятий,
    //а перечислены все изучаемые в рамках конкретного занятия подтемы, подходы, инструменты.
    //Указаны темы всех домашних заданий.
    //Указан объем практики и понятно, в чем она заключается.
    //Указаны часы нагрузки в неделю и общая продолжительность курса.
    //Список изучаемых инструментов опционален,
    //поскольку качественное обучение позволяет выпускнику работать с разными инструментами,
    //а не затачивает его под конкретный.
    //Существуют инструменты, которые используются абсолютно на каждом проекте, но таких немного.

    //Хорошая программа курса — это сбалансированная программа.


    //Шаг 5. Спринты

    //Твой план нужно разбить на временные отрезки по одной или две недели.
    //Это так называемые спринты, из которых будет состоять твой общий учебный марафон.

    //Планируй так, чтобы каждая тема помещалась в один спринт.
    //Если не помещается, разбивай ее на подтемы.

    //Начинай выполнять запланированные обучающие спринты.
    //Если спринт оказывается неудачным, проводи ретроспективу с самим собой.
    //То есть анализируй, что именно пошло не так и как в дальнейшем не наступить на те же грабли.

    //Спринты мы предлагаем использовать не потому, что "так принято в IT",
    //а чтобы они помогали держать тебе темп.


    //Шаг 6. И подготовка к трудоустройству

    //Подготовка к поиску работы должна начинаться с первого дня обучения, то есть в этот же момент.


    //Шаг 7. Стажировка/интернатура

    //Если учишься самостоятельно, то за месяц-два до конца обучения начинай искать место для практики.
    //Если твой план включает обучение на курсе, то еще при его выборе нужно обратить внимание,
    //предлагает ли он по части практики какие-то полноценные варианты.
    //Если нет, то это повод поискать что-то еще.


    //Шаг 8. И активный поиск работы

    //Начинай активный поиск работы.
    //Крайне желательно начать его одновременно со стартом стажировки/интернатуры.


    //Трудно поверить, но нередко встречаются и студенты, которые отклоняют первый оффер,
    //не хватаясь за первое попавшееся предложение.
    //Это студенты, которые учились осознанно, вдумчиво и имеют четкое предоставление,
    //что им должна дать работа в первой компании.


    //Как достичь результата

    //Вхождение в профессию тестировщика займет у тебя от 6 до 12 месяцев.
    //Это значительный срок в твоей жизни, даже если ты планируешь прожить больше ста лет.
    //Не поленись потратить пару дней на составление плана обучения —
    //в конечном итоге он сэкономит тебе минимум несколько месяцев жизни. Обещаем.




}
