public class chapter_02 {
    //Нужно ли становиться QA?

    //1 Надо ли тебе в тестирование?

    //Виды мотиваций
    //Мотивация бывает двух типов — внутренняя и внешняя. Внешнюю мотивацию еще часто называют стимуляцией.

    //Внешняя мотивация или стимуляция: мы делаем что-то, к чему нас вынуждают.
    //Вынуждать могут общественные установки, принятые нормы, мнение наших близких и друзей.
    //Так как мы социальные животные, то это вынуждение оказывает на нас значимое воздействие.

    //(Внутренняя) мотивация — мы делаем что-то, что нам нравится.
    //Мы получаем удовольствие от того, что в процессе раскрываются какие-то наши индивидуальные качества,
    //достоинства или особенности.
    //Мы чувствуем, что мы на своем месте.

    //2 Это легкий путь в IT

    //Тестирование — это НЕ легкий путь в IT.

    //Но это не значит, что оно требует меньше технических знаний, чем программирование.
    //А как ты увидишь в одной из следующих глав,
    //профессия тестировщика однозначно сложнее профессии разработчика с точки зрения
    //сложности получения навыков.
    //Научиться программировать не так сложно, если в достаточной степени развито абстрактное мышление.
    //В среднестатистическом языке программирования всего несколько сотен команд и операторов.
    //Изучить язык программирования намного проще, чем выучить незнакомый человеческий язык.
    //Да, нужно уметь работать с разными фреймворками, библиотеками, архитектурами и паттернами,
    //но базовые понятия здесь достаточно простые,
    //а все остальное надстраивается в виде пирамиды сверху.

    //Не каждый разработчик обладает достаточным знанием по каждому указанному в списке пункту,
    //но тестировщику необходимо знать всё:
    //HTTP, REST, API.
    //Веб-интерфейсы, мокапы и пользовательский опыт (UX).
    //Архитектуры приложений.
    //Реляционные базы данных.
    //Развертывание приложений и миграции данных.
    //Серверная часть приложения, команды и анализ логов.
    //Сети и протоколы.
    //Анализ и восстановление технических требований.
    //Развертывание тестовых окружений.
    //Системы контроля версий.

    //Портрет QA-специалиста
    //Требования к тестировщикам могут различаться очень сильно в зависимости от
    //сферы деятельности компании, принятых в ней процессов и изготавливаемых программных продуктов.
    //Даже внутри одной компании от разных QA может требоваться разное.

    //Качества, которые отличают хорошего тестировщика:
    //•быть "доводчиком, реализатором(opens in a new tab)" (но этого достаточно только на уровне джуна);
    //•въедливость (с одновременным умением вовремя остановиться);
    //•абстрактное и/или структурное мышление;
    //•нестандартное мышление;
    //•широкий технический и нетехнический кругозор;
    //•умение смотреть на один вопрос с разных позиций;
    //•умение ясно и грамотно выражать мысли устно и письменно.

    //ChatGPT и перспективы профессии

    //Немаловажную роль здесь играет и искусственный интеллект,
    //который приведет к исчезновению многих профессий.
    //С вероятностью, близкой к 100%, ко второй половине XXI века все существующие
    //на текущий момент профессии исчезнут или изменятся до неузнаваемости.

    //Может ли тестирование исчезнуть в следующие 20 лет?
    //Вполне возможно. Но вместе с ним умрет и множество других IT и не IT-специальностей.
    //И их обладателям тоже придется переучиваться на что-то новое.

    //Умрет ли тестирование первой из IT-профессий?
    //С высокой степенью вероятности тестирование умрет последней из IT-профессий.
    //Ведь основная работа QA — не тестирование софта (как многие думают),
    //а вытягивание требований из головы заказчика и их синхронизация внутри команды.
    //Нейросети пока не очень умеют эффективно работать с "кожаными мешками" в офлайн.
    //А если и научатся, то сделают это в последнюю очередь.


}
