public class chapter_09 {
    //Как не стрессовать и не сойти с дистанции

    //Топ-10 проблем схода с обучения

    //Перечислим в порядке убывания частоты причины, "выбивающие" студентов из обучения:

    //1
    //"Это не мое", "Попробовал и что-то не понравилось", "Слишком заумно", "Слишком просто и скучно",
    //"Хочется более технической специальности", "Хочется менее технической специальности".

    //2
    //Procrastinatio ordinaria — прокрастинация обыкновенная.

    //3
    //На обучение изначально не выделено достаточно времени, и пошел перегруз.
    //В случае обучения на курсе — получена неверная информация о том,
    //сколько времени нужно будет еженедельно тратить на учебу.
    //Результат — физическое утомление или моральное выгорание.

    //4
    //Некачественное обучение. Программа самостоятельного обучения составлена неправильно,
    //либо выбран низкокачественный курс с плохой программой или низкой организацией.

    //5
    //Внезапный рост загруженности на текущей работе или длительная командировка.

    //6
    //Проблемы личного характера, семейные хлопоты,
    //отсутствие договоренности с близкими по домашним обязанностям,
    //заботе о детях и т.д. или же отсутствие поддержки с их стороны.

    //7
    //Политические обстоятельства, внезапная релокация.

    //8
    //Легкое личное заболевание
    //(достаточно пару ОРЗ по десять дней, чтобы серьезно отстать)
    //или серьезное заболевание в семье.

    //9
    //Лето. Наложение летних месяцев или тем более отпуска на обучение у многих снижают эффективность учебы
    //(хотя отпуск должен вроде бы наоборот помогать).

    //10
    //Финансовые проблемы.


    //Форс-мажоры на самом деле не форс-мажоры

    //Обрати особое внимание на первые пять пунктов,
    //на которые в сумме приходится не меньше 80% "выбытий" из обучения.
    //Чем они отличаются от следующих за ними трех пунктов (#6, 7, 8)?

    //Ответ очень простой: там нет проблем,
    //которые нельзя было бы предвидеть заранее и к которым нельзя было бы подготовиться.


    //Главный источник проблем

    //Если проанализировать топ-3 ухода с обучения, то первопричина станет очевидной.
    //Если кто-то и загонит тебя в пустыню Большого забывания или болота Демотивации, то это будешь ты сам.


    //Как учиться без стресса

    //Как избежать первую причину, мы говорили в одной из предыдущих глав.
    //Теперь поговорим про борьбу со второй и третьей одновременно.

    //1. Контрмера: Беги из замкнутого круга демотивации

    //Наш позитивный опыт помогает нам успешно повторять то хорошее,
    //что когда-то удавалось, и получать от жизни удовольствие.

    //Наш негативный опыт оказывает нам ложную помощь, каждый раз направляя нас не туда,
    //куда нам на самом деле было нужно.

    //Как достичь результата

    //Проанализируй свой предыдущий опыт обучения,
    //выяви демотивирующие моменты и преобразуй их в положительные установки:

    //Демотивирующий момент                             Положительная установка
    //Окружающие не верят,                              Найти единомышленников, которые хотят
    //что у меня что-то получится                       достичь этого сами и будут меня поддерживать

    //Ранее я не оправдал чьих-то ожиданий              Выяснить, чего хочу я сам

    //Раньше получал плохие оценки                      Выбрать обучение с преподавателями,
    //                                                  которые меня "зажгут"

    //Не люблю учиться в группе                         Выбрать обучение без случайно попавших в группу,
    //                                                  которые могут меня демотивировать

    //Была слишком высокая нагрузка                     Мне нужно обучение,
    //                                                  при котором не будет жестких дедлайнов

    //Была низкая нагрузка и было скучно                Мне нужно обучение с жесткими дедлайнами

    //На лекциях мне всегда было                        Хочу обучение где нужно читать, а не смотреть
    //сложно сосредоточиться


    //2. Контрмера: Оцени время и когнитивную нагрузку

    //Для начала имеет смысл потратить лишний час и понять,
    //сколько на обучение времени необходимо и сколько свободного времени есть сейчас.
    //Если из 24 часов вычесть сон, работу, дорогу и маленькие приятные радости жизни.
    //И понять, сходится ли "баланс".

    //Про нагрузку при разных форматах обучения мы поговорим позднее, но сейчас можем сказать,
    //что для обучения средней интенсивности требуется не меньше часа–полутора в каждый будний день
    //и четыре часа в каждый из двух выходных. То есть не менее 13–15 часов каждую неделю.
    //Если доступного времени оказалось меньше,
    //то лучше выбрать формат обучения низкой интенсивности.

    //Кроме физической усталости бывает и когнитивная усталость.

    //Имеет смысл начать контролировать расход этой батарейки,
    //особенно если что-то из следующего имеет к тебе отношение:

    //Утром не чувствую себя отдохнувшим.

    //Чтобы быть работоспособным во второй половине дня, приходится пить кофе или энергетики.

    //Вечером голова "ватная", и в нее ничего не лезет.

    //Получение новых знаний и навыков — это очень ресурсоемкий для мозга процесс,
    //и он будет высаживать батарейку очень мощно.


    //Как достичь результата

    //Проверенные способы от авторов этого учебника:

    //Мозг мозгу рознь. Пойми, в каком виде информацию потребляешь лучше всего (видео, текст, схемы),
    //и старайся изначально получать ее в таком формате или адаптировать под себя.

    //Мозгу нужно привыкнуть и настроиться.
    //Новые привычки вырабатываются за 30–60 дней. Обучение — тоже привычка.

    //Мозгу нужно позволить сосредотачиваться.
    //Чаще всего нас отвлекают внешние звуки, речь или, наоборот, желание чем-то заполнить тишину.
    //Включенная в наушниках музыка без слов (или шумы природы) отсечет один из главных раздражителей.

    //Мозг можно перезагружать в течение дня.
    //30-минутная прогулка на свежем воздухе творит чудеса.

    //Мозг лучше всего работает до полудня.

    //Мозгу со второй попытки может быть легче.
    //Если зашел в тупик, переключись пока на какую-то другую задачу и вернись к этой через полчаса–час.

    //Мозг любит передышку.
    //Каждый час делай перерыв хотя бы на пару минут и в этот же момент записывай,
    //чем предыдущий час занимался.
    //По результатам дня оценивай, насколько продуктивно ты поработал.

    //Мозг с радостью отвлекается.
    //Прими минимальные технические меры.
    //Настрой телефон и компьютер: установи программы для учета проведенного времени вроде
    //RescueTime.
    //Принудительно блокировать доступ на определенные сайты — не самый эффективный способ
    //(начнется игра "обойди запреты от самого себя").

    //Мозг нужно понимать. Изучи, почему прокрастинаторы
    //прокрастинируют и как можно осознанно увиливать от прокрастинации.


    //3. Контрмера: Помни, что тебе нравится

    //Делать то, что нам нравится, — отличная мотивация.
    //Прямо противоположная от стимуляции страхом.
    //Держи в уме свои QA-мотиваторы и мотиваторы со звездочкой.
    //Напомним, что это те мотиваторы, в которых присутствуют
    //"хочу", "люблю", "интересно" и "нравится". А не те, где есть "надо" или "престижно".
    //Помни, куда ты движешься.


    //4. Контрмера: Обращайся к прошлому опыту и ищи ассоциации

    //Хорошее обучение взрослых построено на том, что они обучаются не "с нуля",
    //а с использованием их жизненного опыта.


    //5. Контрмера: Веди дневник успехов

    //В нашей жизни мы часто акцентируемся на неудачах, а не на успехах.
    //И на страхах, а не на гордости за то, что у нас хорошо получилось.


    //6. Контрмера: Попроси помощь заранее

    //В одиночку бороться с чем-либо тяжело. Попроси поддержку у близких и друзей.
    //Программа минимум: сообщи, что начинаешь учиться тестированию.


    //Итого: Как достичь результата

    //Большая часть "неожиданного" происходит вполне предсказуемо.
    //Это оптимистичность или забывчивость конкретного студента.

    //Проанализируй, всё ли ты проработал из того, что необходимо для успешного обучения.

    //Подумай, какие твои слабости могут помешать и что им можно заранее противопоставить.
    //Если ты помнишь про свои слабости и знаешь чем их уравновесить, они перестают быть таковыми.
    //Остальные форс-мажоры маловероятны.

    //Подумай, что тебя "зажигает" и какой предыдущий опыт может тебе помочь.
}

