public class chapter_04 {
    //Когда нужно начинать искать работу?

    //Результат поиска работы — это самая объективная оценка качества обучения.
    //Как бы хорошо ты ни учился и какой бы замечательной ни была теория, которую ты освоил,
    //если работодатель ждет чего-то другого, значит ты учился чему-то не так.

    //Поэтому единственный правильный ответ на вопрос из названия этой главы: "с первого дня обучения".
    //Именно в этом случае ты выучишь то, что действительно нужно рынку.


    //Слагаемые успеха

    //Hard skills
    //Подавляющее большинство книг, бесплатных и платных курсов по тестированию посвящены развитию Hard skills.
    //Hard skills — это твои профессиональные знания и "жесткие навыки",
    //которыми ты будешь обладать по окончании курса.

    //С точки зрения Hard skills подход "поиск работы с первого дня обучения" полезен тем,
    //что ты будешь с самого начала понимать, какой объем и каких знаний тебе необходим.
    //Кроме этого, в принципе меняется и психологический подход к обучению.
    //Одно дело — учить что-то "потому что надо", и другое — учить что-то,
    //потому что видишь такое в каждой второй вакансии.


    //Soft skills
    //Soft skills — это "гибкие или мягкие навыки",
    //которые помогают решать жизненные задачи и взаимовыгодно работать с другими людьми.

    //Есть еще три неприятных новости о Soft skills:
    //они развиваются сложнее, чем Hard skills;
    //на курсах по тестированию им обычно не учат;
    //Soft skills нужны не только для работы, но и для получения этой самой работы.


    //Есть еще два важных момента касательно того,
    //почему подготовку к поиску работы нужно начинать как можно раньше:
    //это пустыня Большого забывания и болота Демотивации.

    //Забыть (почти) всё в пустыне Большого забывания
    //Время обучения тестированию — это небольшой срок по сравнению с продолжительностью человеческой жизни.
    //А в ходе жизни мы получаем значительный объем знаний.
    //И не сильно меньший объем информации забываем.

    //Особенности запоминания знаний
    //Кривая Эббингауза говорит нам,
    //что если мы хотим запомнить определенную информацию надолго,
    //то мы должны повторить ее не один раз

    //В случае самостоятельного обучения тестированию нужно не просто "постоянно идти вперед".
    //Нужно регулярно возвращаться к уже пройденным темам и освежать знания в памяти.
    //Имеет смысл использовать что-то аналогичное карточкам для запоминания слов
    //при изучении иностранных языков
    //Только применять их для запоминания ключевых понятий, терминов, команд и так далее.


    //Отчаяться в болотах Демотивации
    //Изменения в настроениях у слишком многих выпускников QA-курсов,
    //начавших искать работу только после окончания курса, проходят по одному и тому же пути:

    //Позитивное отрицание

    //Гнев

    //Торг (с самим собой)

    //Депрессия

    //Принятие

    //Из-за чего подобное может происходить?

    //В ходе прохождения курса у студента прокачиваются в основном Hard skills — знания и навыки,
    //касающиеся непосредственно специальности.
    //В момент окончания курса может сформироваться ощущение, что этого достаточно.

    //Главное — уметь хорошо делать свою работу, а остальное приложится.


    //Вот несколько заблуждений, которые могут преподнести сюрпризы,
    //расстроить и даже демотивировать на пути к финальной цели — первой полноценной QA-работе:

    //Нет ничего сложного в том, чтобы составить резюме.

    //Кроме резюме, ничего больше не нужно.

    //Отклики на вакансии — дело нехитрое.

    //Отклики на вакансии — единственный способ найти работу.

    //Про меня, мой отклик, мое резюме, мое тестовое, мое собеседование,
    //результаты моего собеседования никогда не забудут.

    //Формат собеседований предполагает, что я только отвечаю на вопросы и жду решения другой стороны.

    //У меня нет возможности развиваться по Hard skills и Soft skills в ходе поиска работы.

    //Обратную связь о том, каких Hard skills и Soft skills мне не хватает, получить невозможно.

    //И, наконец, главное заблуждение: для работодателя мои Hard skills важнее моих Soft skills.


    //Преобразуем эти мифы в отражающие реальность утверждения:

    //Резюме — это артефакт, позволяющий осуществить первичную фильтрацию кандидатов,
    //а значит, оно подвергается анализу. Значит, есть и критерии анализа.

    //Способов дотянуться до необходимых людей — масса.
    //Резюме, как обычно, — лишь верхушка айсберга, среди прочих инструментов и способов:
    //сопроводительное письмо, профиль в LinkedIn, рекомендации,
    //поиск вакансий на порталах компаний, через соцсети,
    //в профильных группах, прямые контакты с людьми, занимающими определённые должности, нетворкинг.

    //Просто откликаться на все подходящие вакансии подряд едва ли имеет смысл.


    //Как избежать стадии "Депрессии" и тем более "Принятия"?

    //Во-первых, если тебе предстоит длинная дорога, то чем раньше ты начнешь по ней двигаться,
    //тем быстрее дойдешь до конца. В среднем поиск работы занимает 2–4 месяца.
    //Иногда он может затянуться на полгода и дольше — особенно в случае международного найма.

    //Если приплюсовывать ко времени обучения еще 2, 4 или 6 месяцев на поиск работы,
    //то срок получается внушительным.
    //Если же наоборот, распараллелить процесс обучения и подготовки к трудоустройству,
    //то протяженность маршрута покажется уже не такой пугающей.

    //Во-вторых, при поиске работы после обучения на курсе ты уже находишься вне учебной группы.
    //У каждого могут случаться периодические моменты отчаяния и прокрастинации, но когда ты один,
    //преодолевать их сложнее.


    //Когда нужно начинать искать работу?

    //Практически всех, у кого возникли проблемы с трудоустройством, объединяет одно:
    //они отложили начало поиска работы до самого последнего момента.
    //В большинстве случаев этот последний момент совпадает с окончанием обучения,
    //когда новичок начинает не торопясь готовить резюме и откликаться на все вакансии подряд.

    //Успешные джуны находят работу еще в ходе стажировки или интернатуры
    //(если она есть на курсе или найдена самостоятельно).
    //Наиболее успешные — еще до ее начала.

    //Даже если ты не ставишь амбициозную цель найти работу уже в первые 2–3 месяца обучения,
    //то чтобы в принципе хоть когда-либо найти ее, следуй рекомендациям:

    //Чем быстрее ты начнешь процесс поиска работы, тем больше знаний ты будешь помнить к собеседованиям.
    //Этим же ты приблизишь трудоустройство, а тем самым и процесс превращения знаний в постоянные навыки.

    //Подготовку к поиску работы лучше всего начинать с первого дня обучения — вне зависимости от того,
    //обучаешься ты самостоятельно или же на курсе.

    //В конечном итоге ты окажешься более конкурентноспособным на рынке труда,
    //и твоя карьера будет развиваться быстрее.


    //Как достичь результата

    //При самостоятельном обучении
    //1. Запланируй не только свое обучение. Нужно запланировать и подготовку к трудоустройству.
    //2. Начинай подготовку к поиску работы и трудоустройству с первого дня обучения тестированию.




}
